Catalogs/АР_ПрограммыДоходности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ПрограммыДоходности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компенсировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКотел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГаранта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПР_ТипыГаранта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АР_ПрограммыДоходности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_ПрограммыДоходности</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Компенсировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрограммаДоходности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ПрограммыДоходности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/АР_ПрограммыДоходности/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	НаборЗаписей = РегистрыСведений.АР_ПрограммыДоходности.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.ПрограммаДоходности.Установить(ЭтотОбъект.Ссылка);
    НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НовЗапись = НаборЗаписей.Добавить();
	    НовЗапись.ПрограммаДоходности = ЭтотОбъект.Ссылка;
	    НовЗапись.Период = ТекущаяДата();
	    НовЗапись.Компенсировать = ЭтотОбъект.Компенсировать;	
	    НаборЗаписей.Записать(Истина);
	КонецЕсли;	
КонецПроцедуры
